# 2. Напишите программу, которая на вход принимает 5 чисел
#  и находит максимальное из них.

my_list = []
for i in range(5):
    num = int(input('--> '))
    my_list.append(num)
print(my_list) 
